In [15]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
print("Hello, Pandas")
print(pd.__version__)

Hello, Pandas
0.24.2

In [4]:
#import the pandas library and aliasing as pd
import pandas as pd
import numpy as np
data1 = np.array(['a','b','c','d'])
s1 = pd.Series(data1)
print(s1)

0    a
1    b
2    c
3    d
dtype: object

In [11]:
data2 = np.array(['a','b','c','d'])
s2 = pd.Series(data2,index=[100,101,102,103])
print(s2)

100    a
101    b
102    c
103    d
dtype: object

In [12]:

data3 = {'a' : 0., 'b' : 1., 'c' : 2.}
s3 = pd.Series(data3)
print(s3)

a    0.0
b    1.0
c    2.0
dtype: float64

In [13]:
s4 = pd.Series(5, index=[0, 1, 2, 3])
print (s4)

0    5
1    5
2    5
3    5
dtype: int64

In [9]:
ss = pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])
#retrieve the first element
print(ss[0]) 
#retrieve the first three element
print(ss[:3]) 
#retrieve the last three element
print(ss[-3:]) 
#可以通过索引标签获取和设置值
#retrieve a single element
print(ss['a'])
#retrieve multiple elements
print(ss[['a','c','d']])
#retrieve error
# print(ss['f'])

1
a    1
b    2
c    3
dtype: int64
c    3
d    4
e    5
dtype: int64
1
a    1
c    3
d    4
dtype: int64

In [2]:
s1 = pd.Series([1,3,5,np.nan,6,8])

print(s1)

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [11]:
import pandas as pd
dataf1 = [1,2,3,4,5]
df1 = pd.DataFrame(dataf1)
print(df1)

   0
0  1
1  2
2  3
3  4
4  5

In [4]:
dates1 = pd.date_range('20191111', periods=7)
print(dates1)

print("--"*16)
df1 = pd.DataFrame(np.random.randn(7,4), index=dates1, columns=list('ABCD'))
print(df1)

DatetimeIndex(['2019-11-11', '2019-11-12', '2019-11-13', '2019-11-14',
               '2019-11-15', '2019-11-16', '2019-11-17'],
              dtype='datetime64[ns]', freq='D')
--------------------------------
                   A         B         C         D
2019-11-11 -0.092716 -2.545588 -0.413231  0.005313
2019-11-12  1.592527  1.114781 -0.790662 -0.899344
2019-11-13 -2.140796 -1.300888  0.494869 -0.796068
2019-11-14 -0.282444  1.071257 -0.873806  1.099147
2019-11-15 -0.055565 -0.892049 -1.274531  0.203611
2019-11-16  0.164986  1.002348  1.719528 -1.991788
2019-11-17  0.136879  0.354911  0.390208 -1.601919

In [12]:
data = [1,2,3,4,5]
#df = pd.DataFrame(data)
df = pd.DataFrame(data,columns=['Money'])
print(df)

   Money
0      1
1      2
2      3
3      4
4      5

In [16]:
#import pandas as pd
dataf2 = [['Alex',10],['Bob',12],['Clarke',13]]
#df2 = pd.DataFrame(dataf2, columns=['Name','Age'])
df2 = pd.DataFrame(dataf2, columns=['Name','Age'],dtype=float)

print(df2)

     Name   Age
0    Alex  10.0
1     Bob  12.0
2  Clarke  13.0

C:\Users\12461\AppData\Local\Temp\ipykernel_11344\215062575.py:4: FutureWarning: Could not cast to float64, falling back to object. This behavior is deprecated. In a future version, when a dtype is passed to 'DataFrame', either all columns will be cast to that dtype, or a TypeError will be raised.
  df2 = pd.DataFrame(dataf2, columns=['Name','Age'],dtype=float)

In [4]:
import pandas as pd
dataf3 = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
#df3 = pd.DataFrame(dataf3)
df3 = pd.DataFrame(dataf3, index=['rank1','rank2','rank3','rank4'])

print(df3)

        Name  Age
rank1    Tom   28
rank2   Jack   34
rank3  Steve   29
rank4  Ricky   42

In [5]:
data11 = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
#df11 = pd.DataFrame(data11)
df11 = pd.DataFrame(data11, index=['first', 'second'])

print(df11)

        a   b     c
first   1   2   NaN
second  5  10  20.0

In [18]:
#With two column indices, values same as dictionary keys
df21 = pd.DataFrame(data11, index=['first', 'second'], columns=['a', 'b'])

#With two column indices with one index with other name
df22 = pd.DataFrame(data11, index=['first', 'second'], columns=['a', 'b1'])
print(df21)
print(df22)

        a   b
first   1   2
second  5  10
        a  b1
first   1 NaN
second  5 NaN

In [19]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
      'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df23 = pd.DataFrame(d)
print(df23)

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [20]:
print ("Adding a new column by passing as Series:")
df23['three']=pd.Series([10,20,30],index=['a','b','c'])
print(df23)

print ("Adding a new column using the existing columns in DataFrame:")
df23['four']=df23['one']+df23['three']

print(df23)

Adding a new column by passing as Series:
   one  two  three
a  1.0    1   10.0
b  2.0    2   20.0
c  3.0    3   30.0
d  NaN    4    NaN
Adding a new column using the existing columns in DataFrame:
   one  two  three  four
a  1.0    1   10.0  11.0
b  2.0    2   20.0  22.0
c  3.0    3   30.0  33.0
d  NaN    4    NaN   NaN

In [22]:
print(df23)

   one  two  three  four
a  1.0    1   10.0  11.0
b  2.0    2   20.0  22.0
c  3.0    3   30.0  33.0
d  NaN    4    NaN   NaN

In [23]:
# Using the previous DataFrame, we will delete a column
# using del function
import pandas as pd

d2 = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']), 
     'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd']), 
     'three' : pd.Series([10,20,30], index=['a','b','c'])}

df24 = pd.DataFrame(d2)
print ("Our dataframe is:")
print(df24)

# using del function
print ("Deleting the first column using DEL function:")
del df24['one']
print(df24)

# using pop function
print ("Deleting another column using POP function:")
df24.pop('two')
print(df24)

Our dataframe is:
   one  two  three
a  1.0    1   10.0
b  2.0    2   20.0
c  3.0    3   30.0
d  NaN    4    NaN
Deleting the first column using DEL function:
   two  three
a    1   10.0
b    2   20.0
c    3   30.0
d    4    NaN
Deleting another column using POP function:
   three
a   10.0
b   20.0
c   30.0
d    NaN

In [24]:
#import pandas as pd
#import numpy as np
#import matplotlib.pyplot as plt

d3 = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']), 
     'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}
df3 = pd.DataFrame(d3)
print(df3['two'])

a    1
b    2
c    3
d    4
Name: two, dtype: int64

In [29]:
print(df3)

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [39]:

#df3 = pd.DataFrame(d3)
print(df3.loc['b'])
print(df3.iloc[1])
print(df3[2:4])

one    2.0
two    2.0
Name: b, dtype: float64
one    2.0
two    2.0
Name: b, dtype: float64
   one  two
c  3.0    3
d  NaN    4

In [45]:
df31 = pd.DataFrame([[1, 2], [3, 4]], columns = ['a','b'])
print(df31) 

df32 = pd.DataFrame([[5, 6], [7, 8]], columns = ['a','b'])

df31 = df31.append(df32)
print(df31)

   a  b
0  1  2
1  3  4
   a  b
0  1  2
1  3  4
0  5  6
1  7  8

C:\Users\12461\AppData\Local\Temp\ipykernel_11344\4007134956.py:6: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df31 = df31.append(df32)

In [46]:
print(df32)
df32=df32.drop(0)
print(df32)

   a  b
0  5  6
1  7  8
   a  b
1  7  8

In [5]:
fruit_price=[{'name':'mango','price':'6.49'},
             {'name':'orange','price':'4.31'},
             {'name':'banana','price':'3.25'},
            {'name':'Cherry','price':'9.98'}]

cheap=min(fruit_price,key=lambda x:x['price'])
expensive=max(fruit_price,key=lambda x:x['price'])
print("最便宜的水果是：",cheap)
print("最贵的水果是：",expensive)

最便宜的水果是： {'name': 'banana', 'price': '3.25'}
最贵的水果是： {'name': 'Cherry', 'price': '9.98'}

In [7]:
#单个sheet excel读取
#import pandas as pd    #通常的做法是将pandas简称为pd
path='C:\\Users\\DELL\\利润表2018.xls'  
#path=r'C:\Users\DELL\利润表2018.xls'     #设置读入数据的路径
df1=pd.read_excel(path,header=0,index_col=None)   #读入excel，header=0,将第一行作为列名
df1.head()    #预览前5行
#其中header选项用来指定行名，默认 header=0 将第一行数据作为行名，依次类推。
#Header=None 不指定行名。index_col 来设置索引，
#index_col=None 重新生成一列作为index值，这里可以指定 
#index_col=0，将第一列作为索引，也可使用 index_col=’stkcd’ 将股票代码作为索引。

,stkcd,b001100000,b001101000,bbd1102000,bbd1102101,bbd1102203,b0i1103000,b0i1103101,b0i1103111,b0i1103203,...,b002000000,b002000101,b002000201,b003000000,b004000000,b005000000,b006000000,b006000101,b006000102,year
0,1,4.480811e+09,NaN,4.193739e+09,7.877700e+09,3.683961e+09,NaN,NaN,NaN,NaN,...,2.897743e+08,2.897743e+08,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2004
1,2,7.667226e+09,7.667226e+09,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,9.126537e+08,8.780063e+08,34647464.65,NaN,NaN,NaN,NaN,NaN,NaN,2004
2,4,1.067478e+08,1.067478e+08,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,-3.282932e+06,-4.062670e+06,779737.52,NaN,NaN,NaN,NaN,NaN,NaN,2004
3,5,4.937819e+07,4.937819e+07,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,1.690340e+06,1.690340e+06,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2004
4,6,1.876976e+09,1.876976e+09,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,4.877079e+07,5.372229e+07,-4951498.51,NaN,NaN,NaN,NaN,NaN,NaN,2004

In [8]:
#multiple sheets
path1=r'C:\Users\DELL\利润表.xls'
xls=pd.ExcelFile(path1)    #读入excel表格
xls.sheet_names     # 查看excel表中所有sheet的名称

['s2004',
 'sheet2005',
 '2006',
 'sh2007',
 'sheet2008',
 'sheet2009',
 'sheet2010',
 'sheet2011']

In [9]:
#可以用sheet_name选项来指定需要读取的sheet，以sheet2005为例：
sheet2005=pd.read_excel(path1,sheet_name='sheet2005')
sheet2005.head()

,stkcd,b001100000,b001101000,bbd1102000,bbd1102101,bbd1102203,b0i1103000,b0i1103101,b0i1103111,b0i1103203,...,b002000000,b002000101,b002000201,b003000000,b004000000,b005000000,b006000000,b006000101,b006000102,year
0,1,4.557763e+09,NaN,4.133321e+09,7.879988e+09,3.746667e+09,NaN,NaN,NaN,NaN,...,3.517275e+08,3.517275e+08,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2005
1,2,1.055885e+10,1.055885e+10,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,1.433426e+09,1.350363e+09,83062895.06,NaN,NaN,NaN,NaN,NaN,NaN,2005
2,4,6.137672e+07,6.137672e+07,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,-1.857741e+07,-1.357701e+07,-5000404.88,NaN,NaN,NaN,NaN,NaN,NaN,2005
3,5,4.539573e+07,4.539573e+07,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,-1.799700e+08,-1.799700e+08,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2005
4,6,1.433865e+09,1.433865e+09,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,1.042226e+08,1.104044e+08,-6181733.48,NaN,NaN,NaN,NaN,NaN,NaN,2005

In [ ]:
#每个sheet作为元素导入到一个名为df的字典中
df=pd.read_excel(path1,sheet_name=None)
# 数据的导出方法和读入相似，
#可以导出成csv、excel、dta、sas等常用格式。导出方法基本相同，
#以导出2005年利润表为例：
sheet2005.to_csv(r'C:\Users\DELL\利润表2005.csv',index=False,header=True,columns=None)
#其中：index指定是否导出索引，默认是True
#header指定是否将列名导出，默认是True
#colums可以指定需要导出的列，默认是None全部导出，如何我们仅仅想导出stkcd和year，则可指定：columns=[‘stkcd’,’year’]。

# 当然也可以导出dta或者xlsx格式：
sheet2005.to_stata(r'C:\Users\DELL\利润表2005.dta',write_index=False)
sheet2005.to_excel(r'C:\Users\DELL\利润表2005.xlsx',index=False,header=True,columns=None)

In [10]:
#Pandas还能导入csv、dta等文件，其方式和读入excel类似：read_csv、read_stata。
#以读入stata中auto数据集为例：
path2=r'C:\Users\DELL\auto.dta'
auto=pd.read_stata(path2)
auto.head()   #展示前五行

,make,price,mpg,rep78,headroom,trunk,weight,length,turn,displacement,gear_ratio,foreign
0,AMC Concord,4099,22,3.0,2.5,11,2930,186,40,121,3.58,Domestic
1,AMC Pacer,4749,17,3.0,3.0,11,3350,173,40,258,2.53,Domestic
2,AMC Spirit,3799,22,NaN,3.0,12,2640,168,35,121,3.08,Domestic
3,Buick Century,4816,20,3.0,4.5,16,3250,196,40,196,2.93,Domestic
4,Buick Electra,7827,15,4.0,4.0,20,4080,222,43,350,2.41,Domestic

In [12]:
auto["price"][0]

4099

In [11]:
#想访问行索引为1、5的make和price的情况：
auto.loc[[1,5],['price','make']]   #按索引
auto.iloc[[1,5],[1,0]]   #按整数位置

   price           make
1   4749      AMC Pacer
5   5788  Buick LeSabre

In [13]:
#stata自带的一组1978年汽车数据的一个变量
#反映了1978年美国不同品牌汽车的交易记录：
#品牌（make）、价格（price）、里程数（mpg）、维修记录（rep78）、净空（headroom）、
#行李箱容积（trunk）、空车质量（weight）、车长（length）、发动机排量（displacement）、
#齿数比（gear_ratio）等
#MPG是MILE PER GALLON=每加伦汽油能距的英里数
#loc和iloc函数还能使用切片的方式来选择范围
auto.loc[0:5,'make':'rep78']   #按照索引的名称
auto.iloc[0:6,0:4]   #按位置 #按照整数位置
#auto[["make","price","rep78"]][0:6]
#数据修改 auto=auto.loc[0:5,'make':'rep78']

            make  price  mpg  rep78
0    AMC Concord   4099   22    3.0
1      AMC Pacer   4749   17    3.0
2     AMC Spirit   3799   22    NaN
3  Buick Century   4816   20    3.0
4  Buick Electra   7827   15    4.0
5  Buick LeSabre   5788   18    3.0

In [15]:
#想查询价格大于14000的车型
select1=auto.price>=14000
auto.loc[select1]

,make,price,mpg,rep78,headroom,trunk,weight,length,turn,displacement,gear_ratio,foreign
11,Cad. Eldorado,14500,14,2.0,3.5,16,3900,204,43,350,2.19,Domestic
12,Cad. Seville,15906,21,3.0,3.0,13,4290,204,45,350,2.24,Domestic

In [16]:
#价格大于10000的外国车，并只需要品牌、价格、是否国产三个信息
select2=(auto.price>=10000)&(auto.foreign=="Foreign")
auto.loc[select2,["make","price","foreign"]]
#auto[(auto.price>=10000)&(auto.foreign=="Foreign")][["make","price","foreign"]]

           make  price  foreign
63  Peugeot 604  12990  Foreign
73    Volvo 260  11995  Foreign

In [17]:
#想要挑选mpg等于18、19、20的观测要怎么处理呢？
#一个相对简单直接的方法是
#设定auto.”price”==18| auto.”price”==19| auto.”price”==20，
#但如果条件很多就看起来很繁琐。可以使用函数DataFrame.isin()，
#括号内可以添加列表，用以判断DataFame中元素是否在列表中，也可以对series使用
select3=auto.loc[:,"mpg"].isin([18,19,20])
#这样select3就是一个布尔型序列，用以判断每行的mpg是否等于每行的值，
#然后就可以使用loc()函数将值提取出来：
auto.loc[select3,["make","mpg"]]

                make  mpg
3      Buick Century   20
5      Buick LeSabre   18
7        Buick Regal   20
9      Buick Skylark   19
18        Chev. Nova   19
20    Dodge Diplomat   18
31     Merc. Monarch   18
33      Merc. Zephyr   20
35    Olds Cutl Supr   19
36      Olds Cutlass   19
37     Olds Delta 88   18
38        Olds Omega   19
45      Plym. Volare   18
46    Pont. Catalina   18
47    Pont. Firebird   18
48  Pont. Grand Prix   19
49     Pont. Le Mans   19
50     Pont. Phoenix   19
66     Toyota Celica   18
68     Toyota Corona   18